---
kind: other
id: Methods.T:Autodesk.Revit.DB.ParameterSet
source: html/9f207991-413e-f15f-0698-d7c941e985ca.htm
---
# ParameterSet Methods

Removes every parameter from the set, rendering it empty.